In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [2]:
df = pd.read_csv('./term-deposit-marketing-2020.csv')
df.head()

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,y
0,58,management,married,tertiary,no,2143,yes,no,unknown,5,may,261,1,no
1,44,technician,single,secondary,no,29,yes,no,unknown,5,may,151,1,no
2,33,entrepreneur,married,secondary,no,2,yes,yes,unknown,5,may,76,1,no
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,no
4,33,unknown,single,unknown,no,1,no,no,unknown,5,may,198,1,no

In [3]:
## check for null values

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 40000 entries, 0 to 39999
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        40000 non-null  int64
 1   job        40000 non-null  object
 2   marital    40000 non-null  object
 3   education  40000 non-null  object
 4   default    40000 non-null  object
 5   balance    40000 non-null  int64
 6   housing    40000 non-null  object
 7   loan       40000 non-null  object
 8   contact    40000 non-null  object
 9   day        40000 non-null  int64
 10  month      40000 non-null  object
 11  duration   40000 non-null  int64
 12  campaign   40000 non-null  int64
 13  y          40000 non-null  object
dtypes: int64(5), object(9)
memory usage: 4.3+ MB

In [11]:
df['job'].value_counts()

blue-collar      9383
management       8166
technician       6852
admin            4483
services         3910
retired          1437
self-employed    1414
entrepreneur     1405
unemployed       1104
housemaid        1087
student           524
unknown           235
Name: job, dtype: int64

In [12]:
df['education'].value_counts()

secondary    20993
tertiary     11206
primary       6270
unknown       1531
Name: education, dtype: int64

In [38]:
df['contact'].value_counts()

cellular     24914
unknown      12765
telephone     2321
Name: contact, dtype: int64

Even though there are no null values in the dataset, there are 'unknown' values in the job, education, and contact columns. Let's take care of these unknown values before moving on.

In [40]:
df.loc[(df['education'] == 'unknown') & (df['job'] == 'blue-collar')]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,y
3,47,blue-collar,married,unknown,no,1506,yes,no,unknown,5,may,92,1,no
42,60,blue-collar,married,unknown,no,104,yes,no,unknown,5,may,22,1,no
57,47,blue-collar,married,unknown,no,306,yes,no,unknown,5,may,13,1,no
58,40,blue-collar,single,unknown,no,24,yes,no,unknown,5,may,185,1,no
64,49,blue-collar,married,unknown,no,154,yes,no,unknown,5,may,357,1,no
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
39286,32,blue-collar,single,unknown,no,258,yes,no,cellular,18,may,291,2,no
39349,37,blue-collar,married,unknown,no,-118,yes,no,cellular,18,may,21,2,no
39426,53,blue-collar,married,unknown,no,2509,no,no,telephone,22,may,231,2,yes
39701,24,blue-collar,single,unknown,no,192,no,no,cellular,27,may,424,1,no
39929,35,blue-collar,married,unknown,no,444,no,no,cellular,2,jun,59,2,no

In [75]:
df.loc[(df['job'] == 'unemployed')]['education'].value_counts()

secondary    622
primary      230
tertiary     228
unknown       24
Name: education, dtype: int64

In [51]:
df.describe()

                age        balance           day      duration      campaign
count  40000.000000   40000.000000  40000.000000  40000.000000  40000.000000
mean      40.544600    1274.277550     16.017225    254.824300      2.882175
std        9.641776    2903.769716      8.278127    259.366498      3.239051
min       19.000000   -8019.000000      1.000000      0.000000      1.000000
25%       33.000000      54.000000      8.000000    100.000000      1.000000
50%       39.000000     407.000000     17.000000    175.000000      2.000000
75%       48.000000    1319.000000     21.000000    313.000000      3.000000
max       95.000000  102127.000000     31.000000   4918.000000     63.000000

In [ ]:
## create a new column

In [76]:
df['y'].value_counts()

no     37104
yes     2896
Name: y, dtype: int64

In [84]:
df.loc[(df['y'] == 'yes')].describe()

               age       balance          day     duration     campaign
count  2896.000000   2896.000000  2896.000000  2896.000000  2896.000000
mean     39.844959   1588.495856    15.827003   682.958564     2.414365
std      11.001984   2924.894429     8.557604   431.287174     2.306015
min      19.000000  -3058.000000     1.000000     8.000000     1.000000
25%      31.000000    141.000000     8.000000   364.000000     1.000000
50%      37.000000    620.000000    16.000000   629.000000     2.000000
75%      47.000000   1820.500000    22.000000   913.000000     3.000000
max      95.000000  45248.000000    31.000000  3881.000000    32.000000